<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------
return [
    // 使用复合缓存类型
    'type'  =>  'complex',
    // 默认使用的缓存
    'default'   =>  [
        // 驱动方式
        'type'   => 'file',
        // 缓存保存目录
        'path'   => Env::get('runtime_path') . 'cache/',
    ],
    // 文件缓存
    'file'   =>  [
        // 驱动方式
        'type'   => 'file',
        // 全局缓存有效期（0为永久有效）
        'expire' =>  0,
        // 设置不同的缓存保存目录
        'path'   => Env::get('runtime_path') . 'cache/',
    ],
    // redis缓存
    'redis'   =>  [
		// 驱动方式
		'type'     => 'redis',
		// 服务器地址
		'host'     => '127.0.0.1',
		// 端口
		'port'     => 6379,
		// auth验证
		'password' => 'xG21Xw6S31FRUMFT',
		// 差异化环境前缀
		'prefix'   => SITE_ENVIROMENT . ':one:',
		// 缓存默认过期时间[永不过期]
		'expire'   => 0,
    ],
];